
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |   🔴 Destroy |
|:---------:|--------:|-----------:|------------:|
|     ✅     |       3 |          1 |           3 |
## Affected resources by action

|  Action  | Resources                                                    |
|:--------:|:-------------------------------------------------------------|
|    🟡     | `module.jumphost.aws_lambda_function.update_dns`             |
|    🟡     | `module.jumphost.null_resource.install_python_dependencies:` |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/b7d5526a-a08f-40db-8457-470a3db94ad0/terraform-bin plan -no-color --out=tf.plan
module.jumphost.null_resource.install_python_dependencies: Refreshing state... [id=7294305284972903828]
module.jumphost.random_uuid.lamda_src_hash: Refreshing state... [id=2dbdd39e-3633-86ed-c328-44503bd1a4de]
data.aws_availability_zones.uw1: Reading...
module.jumphost.data.aws_region.current: Reading...
data.aws_ami.ubuntu_22: Reading...
module.jumphost.data.aws_iam_policy_document.jumphost_permissions: Reading...
module.jumphost.module.jumphost_profile.data.aws_iam_policy_document.assume: Reading...
module.jumphost.data.aws_iam_policy_document.assume_role: Reading...
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.administrator-access: Reading...
module.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com]
module.jumphost.aws_s3_bucket.lambda_tmp: Refreshing state... [id=infrahouse-jumphost-lambda-20230713233459675800000001]
module.jumphost.data.aws_ami.ubuntu_22: Reading...
module.jumphost.data.aws_region.current: Read complete after 0s [id=us-west-1]
module.jumphost.data.aws_iam_policy_document.jumphost_permissions: Read complete after 0s [id=1152265192]
module.jumphost.module.jumphost_profile.data.aws_iam_policy_document.assume: Read complete after 0s [id=1903849331]
module.jumphost.data.aws_caller_identity.current: Reading...
module.jumphost.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=3693445097]
module.infrahouse_com.aws_route53_zone.infrahouse_com: Refreshing state... [id=Z07662251LH3YRF2ERM3G]
module.jumphost.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Reading...
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Reading...
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=3894068826]
module.management.aws_vpc.vpc: Refreshing state... [id=vpc-08e19d859c26d18b2]
data.aws_availability_zones.uw1: Read complete after 0s [id=us-west-1]
aws_key_pair.aleks: Refreshing state... [id=aleks]
data.aws_iam_policy.administrator-access: Reading...
module.jumphost.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]
module.jumphost.module.jumphost_profile.aws_iam_role.profile: Refreshing state... [id=jumphost20230710043044761000000002]
data.aws_ami.ubuntu_22: Read complete after 0s [id=ami-0793452df88d33c63]
module.jumphost.aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
module.jumphost.data.aws_ami.ubuntu_22: Read complete after 0s [id=ami-0793452df88d33c63]
module.jumphost.module.jumphost_profile.aws_iam_policy.profile: Refreshing state... [id=arn:aws:iam::493370826424:policy/jumphost20230710043044760400000001]
module.management.aws_eip.nat_eip["10.0.0.0/24"]: Refreshing state... [id=eipalloc-02b42e70d52a5db7f]
module.management.aws_eip.nat_eip["10.0.2.0/24"]: Refreshing state... [id=eipalloc-016035246b49102b5]
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Reading...
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=3911844868]
module.ih-tf-aws-control-493370826424-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-493370826424-github]
module.jumphost.aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-jumphost-lambda-20230713233459675800000001]
module.jumphost.aws_s3_object.lambda_package: Refreshing state... [id=2dbdd39e-3633-86ed-c328-44503bd1a4de.zip]
module.infrahouse_com.aws_route53_record.spf: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_SPF]
module.infrahouse_com.aws_route53_record.txt_dkim: Refreshing state... [id=Z07662251LH3YRF2ERM3G_google._domainkey.infrahouse.com_TXT]
module.infrahouse_com.aws_route53_record.mx: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_MX]
module.infrahouse_com.aws_route53_record.txt_spf: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_TXT]
module.jumphost.module.jumphost_profile.aws_iam_instance_profile.profile: Refreshing state... [id=jumphost]
module.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.jumphost: Refreshing state... [id=jumphost20230710043044761000000002-20230710043045781100000003]
module.management.aws_default_security_group.default: Refreshing state... [id=sg-08b960b85f5996100]
module.management.aws_internet_gateway.ig: Refreshing state... [id=igw-079090e09ed5db582]
module.jumphost.aws_lambda_function.update_dns: Refreshing state... [id=update_dns]
module.management.aws_route_table.all["10.0.2.0/24"]: Refreshing state... [id=rtb-0bc6c44c1b26fed22]
module.management.aws_subnet.all["10.0.0.0/24"]: Refreshing state... [id=subnet-0df885dcc99418799]
module.management.aws_subnet.all["10.0.1.0/24"]: Refreshing state... [id=subnet-0f91dd2675e7a16c3]
module.management.aws_subnet.all["10.0.2.0/24"]: Refreshing state... [id=subnet-083e969dc3779af26]
module.management.aws_subnet.all["10.0.3.0/24"]: Refreshing state... [id=subnet-0cfffaca325d93827]
module.management.aws_route_table.all["10.0.3.0/24"]: Refreshing state... [id=rtb-0178e1718deba51ce]
module.management.aws_route_table.all["10.0.0.0/24"]: Refreshing state... [id=rtb-04a16e74d5b12a338]
module.management.aws_route_table.all["10.0.1.0/24"]: Refreshing state... [id=rtb-067c30e65dd4108e9]
module.management.aws_default_route_table.default: Refreshing state... [id=rtb-0d73383afeb6ad142]
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Reading...
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=1382937169]
module.management.aws_nat_gateway.nat_gw["10.0.2.0/24"]: Refreshing state... [id=nat-08b1cd06b043099ec]
module.management.aws_nat_gateway.nat_gw["10.0.0.0/24"]: Refreshing state... [id=nat-08fb9b52683277947]
module.jumphost.aws_cloudwatch_log_group.update_dns: Refreshing state... [id=/aws/lambda/update_dns]
module.ih-tf-aws-control-493370826424-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin]
module.jumphost.aws_launch_template.jumphost: Refreshing state... [id=lt-01a8ef96822b4b00b]
module.management.aws_route.default_main: Refreshing state... [id=r-rtb-0d73383afeb6ad1421080289494]
module.management.aws_route_table_association.private_rt_assoc["10.0.1.0/24"]: Refreshing state... [id=rtbassoc-099b958af19485f2b]
module.management.aws_route_table_association.private_rt_assoc["10.0.2.0/24"]: Refreshing state... [id=rtbassoc-0e795bdaee627aa6c]
module.management.aws_route_table_association.private_rt_assoc["10.0.3.0/24"]: Refreshing state... [id=rtbassoc-0bf278b6a394aed44]
module.management.aws_route_table_association.private_rt_assoc["10.0.0.0/24"]: Refreshing state... [id=rtbassoc-08a410160e2dcc592]
module.management.aws_route.subnet_public["10.0.0.0/24"]: Refreshing state... [id=r-rtb-04a16e74d5b12a3381080289494]
module.management.aws_route.subnet_public["10.0.2.0/24"]: Refreshing state... [id=r-rtb-0bc6c44c1b26fed221080289494]
module.management.aws_route.subnet_private["10.0.1.0/24"]: Refreshing state... [id=r-rtb-067c30e65dd4108e91080289494]
module.management.aws_route.subnet_private["10.0.3.0/24"]: Refreshing state... [id=r-rtb-0178e1718deba51ce1080289494]
module.jumphost.aws_autoscaling_group.jumphost: Refreshing state... [id=jumphost-20230710045512165400000001]
module.jumphost.data.aws_iam_policy_document.lambda_logging: Reading...
module.jumphost.data.aws_iam_policy_document.lambda_logging: Read complete after 0s [id=2267145382]
module.jumphost.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::493370826424:policy/lambda_logging20230711160513778300000003]
module.jumphost.aws_cloudwatch_event_rule.scale: Refreshing state... [id=jumphost-scale20230711172747504700000001]
module.jumphost.data.aws_iam_policy_document.lambda-permissions: Reading...
module.jumphost.aws_autoscaling_lifecycle_hook.launching: Refreshing state... [id=launching]
module.jumphost.aws_autoscaling_lifecycle_hook.terminating: Refreshing state... [id=terminating]
module.jumphost.data.aws_iam_policy_document.lambda-permissions: Read complete after 0s [id=748305731]
module.jumphost.aws_iam_policy.lambda_permissions: Refreshing state... [id=arn:aws:iam::493370826424:policy/lambda_permissions20230711160512724200000001]
module.jumphost.aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=iam_for_lambda-20230711160514251100000004]
module.jumphost.aws_lambda_permission.allow_cloudwatch: Refreshing state... [id=AllowExecutionFromCloudWatch-out]
module.jumphost.aws_cloudwatch_event_target.scale-out: Refreshing state... [id=jumphost-scale20230711172747504700000001-terraform-20230711172747630900000002]
module.jumphost.aws_iam_role_policy_attachment.lambda_permissions: Refreshing state... [id=iam_for_lambda-20230711160513416100000002]
module.jumphost.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Read complete after 2s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
module.jumphost.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole: Refreshing state... [id=iam_for_lambda-20230710175434878000000001]
data.aws_iam_policy.administrator-access: Read complete after 2s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.administrator-access: Read complete after 3s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.ih-tf-aws-control-493370826424-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin-20230709164321319900000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.jumphost.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "modules/jumphost/update_dns"
      + type                = "zip"
    }

  # module.jumphost.aws_lambda_function.update_dns will be updated in-place
  ~ resource "aws_lambda_function" "update_dns" {
        id                             = "update_dns"
      ~ last_modified                  = "2023-07-16T05:13:04.000+0000" -> (known after apply)
      ~ s3_key                         = "2dbdd39e-3633-86ed-c328-44503bd1a4de.zip" -> (known after apply)
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.jumphost.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "b565a541adb2b2771244e77b90bd16bf-3" -> (known after apply)
      ~ id                     = "2dbdd39e-3633-86ed-c328-44503bd1a4de.zip" -> (known after apply)
      ~ key                    = "2dbdd39e-3633-86ed-c328-44503bd1a4de.zip" # forces replacement -> (known after apply) # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "modules/jumphost/2dbdd39e-3633-86ed-c328-44503bd1a4de.zip" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      + version_id             = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.jumphost.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "7294305284972903828" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "main_version"         = "04ec5afc734952e7b49d847dc27d778a" -> "0f3cf58cd9bc9986d239945557a3f23d"
            # (1 unchanged element hidden)
        }
    }

  # module.jumphost.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "2dbdd39e-3633-86ed-c328-44503bd1a4de" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "main.py"          = "04ec5afc734952e7b49d847dc27d778a" -> "0f3cf58cd9bc9986d239945557a3f23d"
            # (1 unchanged element hidden)
        }
      ~ result  = "2dbdd39e-3633-86ed-c328-44503bd1a4de" -> (known after apply)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
::debug::Terraform exited with code 0.
::debug::stdout: module.jumphost.null_resource.install_python_dependencies: Refreshing state... [id=7294305284972903828]%0Amodule.jumphost.random_uuid.lamda_src_hash: Refreshing state... [id=2dbdd39e-3633-86ed-c328-44503bd1a4de]%0Adata.aws_availability_zones.uw1: Reading...%0Amodule.jumphost.data.aws_region.current: Reading...%0Adata.aws_ami.ubuntu_22: Reading...%0Amodule.jumphost.data.aws_iam_policy_document.jumphost_permissions: Reading...%0Amodule.jumphost.module.jumphost_profile.data.aws_iam_policy_document.assume: Reading...%0Amodule.jumphost.data.aws_iam_policy_document.assume_role: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.administrator-access: Reading...%0Amodule.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com]%0Amodule.jumphost.aws_s3_bucket.lambda_tmp: Refreshing state... [id=infrahouse-jumphost-lambda-20230713233459675800000001]%0Amodule.jumphost.data.aws_ami.ubuntu_22: Reading...%0Amodule.jumphost.data.aws_region.current: Read complete after 0s [id=us-west-1]%0Amodule.jumphost.data.aws_iam_policy_document.jumphost_permissions: Read complete after 0s [id=1152265192]%0Amodule.jumphost.module.jumphost_profile.data.aws_iam_policy_document.assume: Read complete after 0s [id=1903849331]%0Amodule.jumphost.data.aws_caller_identity.current: Reading...%0Amodule.jumphost.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=3693445097]%0Amodule.infrahouse_com.aws_route53_zone.infrahouse_com: Refreshing state... [id=Z07662251LH3YRF2ERM3G]%0Amodule.jumphost.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=3894068826]%0Amodule.management.aws_vpc.vpc: Refreshing state... [id=vpc-08e19d859c26d18b2]%0Adata.aws_availability_zones.uw1: Read complete after 0s [id=us-west-1]%0Aaws_key_pair.aleks: Refreshing state... [id=aleks]%0Adata.aws_iam_policy.administrator-access: Reading...%0Amodule.jumphost.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]%0Amodule.jumphost.module.jumphost_profile.aws_iam_role.profile: Refreshing state... [id=jumphost20230710043044761000000002]%0Adata.aws_ami.ubuntu_22: Read complete after 0s [id=ami-0793452df88d33c63]%0Amodule.jumphost.aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]%0Amodule.jumphost.data.aws_ami.ubuntu_22: Read complete after 0s [id=ami-0793452df88d33c63]%0Amodule.jumphost.module.jumphost_profile.aws_iam_policy.profile: Refreshing state... [id=arn:aws:iam::493370826424:policy/jumphost20230710043044760400000001]%0Amodule.management.aws_eip.nat_eip["10.0.0.0/24"]: Refreshing state... [id=eipalloc-02b42e70d52a5db7f]%0Amodule.management.aws_eip.nat_eip["10.0.2.0/24"]: Refreshing state... [id=eipalloc-016035246b49102b5]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=3911844868]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-493370826424-github]%0Amodule.jumphost.aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-jumphost-lambda-20230713233459675800000001]%0Amodule.jumphost.aws_s3_object.lambda_package: Refreshing state... [id=2dbdd39e-3633-86ed-c328-44503bd1a4de.zip]%0Amodule.infrahouse_com.aws_route53_record.spf: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_SPF]%0Amodule.infrahouse_com.aws_route53_record.txt_dkim: Refreshing state... [id=Z07662251LH3YRF2ERM3G_google._domainkey.infrahouse.com_TXT]%0Amodule.infrahouse_com.aws_route53_record.mx: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_MX]%0Amodule.infrahouse_com.aws_route53_record.txt_spf: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_TXT]%0Amodule.jumphost.module.jumphost_profile.aws_iam_instance_profile.profile: Refreshing state... [id=jumphost]%0Amodule.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.jumphost: Refreshing state... [id=jumphost20230710043044761000000002-20230710043045781100000003]%0Amodule.management.aws_default_security_group.default: Refreshing state... [id=sg-08b960b85f5996100]%0Amodule.management.aws_internet_gateway.ig: Refreshing state... [id=igw-079090e09ed5db582]%0Amodule.jumphost.aws_lambda_function.update_dns: Refreshing state... [id=update_dns]%0Amodule.management.aws_route_table.all["10.0.2.0/24"]: Refreshing state... [id=rtb-0bc6c44c1b26fed22]%0Amodule.management.aws_subnet.all["10.0.0.0/24"]: Refreshing state... [id=subnet-0df885dcc99418799]%0Amodule.management.aws_subnet.all["10.0.1.0/24"]: Refreshing state... [id=subnet-0f91dd2675e7a16c3]%0Amodule.management.aws_subnet.all["10.0.2.0/24"]: Refreshing state... [id=subnet-083e969dc3779af26]%0Amodule.management.aws_subnet.all["10.0.3.0/24"]: Refreshing state... [id=subnet-0cfffaca325d93827]%0Amodule.management.aws_route_table.all["10.0.3.0/24"]: Refreshing state... [id=rtb-0178e1718deba51ce]%0Amodule.management.aws_route_table.all["10.0.0.0/24"]: Refreshing state... [id=rtb-04a16e74d5b12a338]%0Amodule.management.aws_route_table.all["10.0.1.0/24"]: Refreshing state... [id=rtb-067c30e65dd4108e9]%0Amodule.management.aws_default_route_table.default: Refreshing state... [id=rtb-0d73383afeb6ad142]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=1382937169]%0Amodule.management.aws_nat_gateway.nat_gw["10.0.2.0/24"]: Refreshing state... [id=nat-08b1cd06b043099ec]%0Amodule.management.aws_nat_gateway.nat_gw["10.0.0.0/24"]: Refreshing state... [id=nat-08fb9b52683277947]%0Amodule.jumphost.aws_cloudwatch_log_group.update_dns: Refreshing state... [id=/aws/lambda/update_dns]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin]%0Amodule.jumphost.aws_launch_template.jumphost: Refreshing state... [id=lt-01a8ef96822b4b00b]%0Amodule.management.aws_route.default_main: Refreshing state... [id=r-rtb-0d73383afeb6ad1421080289494]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.1.0/24"]: Refreshing state... [id=rtbassoc-099b958af19485f2b]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.2.0/24"]: Refreshing state... [id=rtbassoc-0e795bdaee627aa6c]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.3.0/24"]: Refreshing state... [id=rtbassoc-0bf278b6a394aed44]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.0.0/24"]: Refreshing state... [id=rtbassoc-08a410160e2dcc592]%0Amodule.management.aws_route.subnet_public["10.0.0.0/24"]: Refreshing state... [id=r-rtb-04a16e74d5b12a3381080289494]%0Amodule.management.aws_route.subnet_public["10.0.2.0/24"]: Refreshing state... [id=r-rtb-0bc6c44c1b26fed221080289494]%0Amodule.management.aws_route.subnet_private["10.0.1.0/24"]: Refreshing state... [id=r-rtb-067c30e65dd4108e91080289494]%0Amodule.management.aws_route.subnet_private["10.0.3.0/24"]: Refreshing state... [id=r-rtb-0178e1718deba51ce1080289494]%0Amodule.jumphost.aws_autoscaling_group.jumphost: Refreshing state... [id=jumphost-20230710045512165400000001]%0Amodule.jumphost.data.aws_iam_policy_document.lambda_logging: Reading...%0Amodule.jumphost.data.aws_iam_policy_document.lambda_logging: Read complete after 0s [id=2267145382]%0Amodule.jumphost.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::493370826424:policy/lambda_logging20230711160513778300000003]%0Amodule.jumphost.aws_cloudwatch_event_rule.scale: Refreshing state... [id=jumphost-scale20230711172747504700000001]%0Amodule.jumphost.data.aws_iam_policy_document.lambda-permissions: Reading...%0Amodule.jumphost.aws_autoscaling_lifecycle_hook.launching: Refreshing state... [id=launching]%0Amodule.jumphost.aws_autoscaling_lifecycle_hook.terminating: Refreshing state... [id=terminating]%0Amodule.jumphost.data.aws_iam_policy_document.lambda-permissions: Read complete after 0s [id=748305731]%0Amodule.jumphost.aws_iam_policy.lambda_permissions: Refreshing state... [id=arn:aws:iam::493370826424:policy/lambda_permissions20230711160512724200000001]%0Amodule.jumphost.aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=iam_for_lambda-20230711160514251100000004]%0Amodule.jumphost.aws_lambda_permission.allow_cloudwatch: Refreshing state... [id=AllowExecutionFromCloudWatch-out]%0Amodule.jumphost.aws_cloudwatch_event_target.scale-out: Refreshing state... [id=jumphost-scale20230711172747504700000001-terraform-20230711172747630900000002]%0Amodule.jumphost.aws_iam_role_policy_attachment.lambda_permissions: Refreshing state... [id=iam_for_lambda-20230711160513416100000002]%0Amodule.jumphost.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Read complete after 2s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]%0Amodule.jumphost.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole: Refreshing state... [id=iam_for_lambda-20230710175434878000000001]%0Adata.aws_iam_policy.administrator-access: Read complete after 2s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.administrator-access: Read complete after 3s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin-20230709164321319900000001]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.jumphost.data.archive_file.lambda will be read during apply%0A  # (config refers to values not yet known)%0A <= data "archive_file" "lambda" {%0A      + excludes            = [%0A          + "__pycache__",%0A        ]%0A      + id                  = (known after apply)%0A      + output_base64sha256 = (known after apply)%0A      + output_base64sha512 = (known after apply)%0A      + output_md5          = (known after apply)%0A      + output_path         = (known after apply)%0A      + output_sha          = (known after apply)%0A      + output_sha256       = (known after apply)%0A      + output_sha512       = (known after apply)%0A      + output_size         = (known after apply)%0A      + source_dir          = "modules/jumphost/update_dns"%0A      + type                = "zip"%0A    }%0A%0A  # module.jumphost.aws_lambda_function.update_dns will be updated in-place%0A  ~ resource "aws_lambda_function" "update_dns" {%0A        id                             = "update_dns"%0A      ~ last_modified                  = "2023-07-16T05:13:04.000+0000" -> (known after apply)%0A      ~ s3_key                         = "2dbdd39e-3633-86ed-c328-44503bd1a4de.zip" -> (known after apply)%0A        tags                           = {}%0A        # (21 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # module.jumphost.aws_s3_object.lambda_package must be replaced%0A-/+ resource "aws_s3_object" "lambda_package" {%0A      ~ bucket_key_enabled     = false -> (known after apply)%0A      ~ content_type           = "binary/octet-stream" -> (known after apply)%0A      ~ etag                   = "b565a541adb2b2771244e77b90bd16bf-3" -> (known after apply)%0A      ~ id                     = "2dbdd39e-3633-86ed-c328-44503bd1a4de.zip" -> (known after apply)%0A      ~ key                    = "2dbdd39e-3633-86ed-c328-44503bd1a4de.zip" # forces replacement -> (known after apply) # forces replacement%0A      + kms_key_id             = (known after apply)%0A      - metadata               = {} -> null%0A      ~ server_side_encryption = "AES256" -> (known after apply)%0A      ~ source                 = "modules/jumphost/2dbdd39e-3633-86ed-c328-44503bd1a4de.zip" -> (known after apply)%0A      ~ storage_class          = "STANDARD" -> (known after apply)%0A      - tags                   = {} -> null%0A      + version_id             = (known after apply)%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # module.jumphost.null_resource.install_python_dependencies must be replaced%0A-/+ resource "null_resource" "install_python_dependencies" {%0A      ~ id       = "7294305284972903828" -> (known after apply)%0A      ~ triggers = { # forces replacement%0A          ~ "main_version"         = "04ec5afc734952e7b49d847dc27d778a" -> "0f3cf58cd9bc9986d239945557a3f23d"%0A            # (1 unchanged element hidden)%0A        }%0A    }%0A%0A  # module.jumphost.random_uuid.lamda_src_hash must be replaced%0A-/+ resource "random_uuid" "lamda_src_hash" {%0A      ~ id      = "2dbdd39e-3633-86ed-c328-44503bd1a4de" -> (known after apply)%0A      ~ keepers = { # forces replacement%0A          ~ "main.py"          = "04ec5afc734952e7b49d847dc27d778a" -> "0f3cf58cd9bc9986d239945557a3f23d"%0A            # (1 unchanged element hidden)%0A        }%0A      ~ result  = "2dbdd39e-3633-86ed-c328-44503bd1a4de" -> (known after apply)%0A    }%0A%0APlan: 3 to add, 1 to change, 3 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgInN0ZG91dCI6ICJbY29tbWFuZF0vaG9tZS9ydW5uZXIvd29yay9fdGVtcC9iN2Q1NTI2YS1hMDhmLTQwZGItODQ1Ny00NzBhM2RiOTRhZDAvdGVycmFmb3JtLWJpbiBwbGFuIC1uby1jb2xvciAtLW91dD10Zi5wbGFuXG5tb2R1bGUuanVtcGhvc3QubnVsbF9yZXNvdXJjZS5pbnN0YWxsX3B5dGhvbl9kZXBlbmRlbmNpZXM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTcyOTQzMDUyODQ5NzI5MDM4MjhdXG5tb2R1bGUuanVtcGhvc3QucmFuZG9tX3V1aWQubGFtZGFfc3JjX2hhc2g6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTJkYmRkMzllLTM2MzMtODZlZC1jMzI4LTQ0NTAzYmQxYTRkZV1cbmRhdGEuYXdzX2F2YWlsYWJpbGl0eV96b25lcy51dzE6IFJlYWRpbmcuLi5cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19yZWdpb24uY3VycmVudDogUmVhZGluZy4uLlxuZGF0YS5hd3NfYW1pLnVidW50dV8yMjogUmVhZGluZy4uLlxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuanVtcGhvc3RfcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbm1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZGluZy4uLlxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lX3JvbGU6IFJlYWRpbmcuLi5cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZGluZy4uLlxubW9kdWxlLmdpdGh1Yi1jb25uZWN0b3IuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV1cbm1vZHVsZS5qdW1waG9zdC5hd3NfczNfYnVja2V0LmxhbWJkYV90bXA6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtanVtcGhvc3QtbGFtYmRhLTIwMjMwNzEzMjMzNDU5Njc1ODAwMDAwMDAxXVxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2FtaS51YnVudHVfMjI6IFJlYWRpbmcuLi5cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19yZWdpb24uY3VycmVudDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9dXMtd2VzdC0xXVxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuanVtcGhvc3RfcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTExNTIyNjUxOTJdXG5tb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTE5MDM4NDkzMzFdXG5tb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfY2FsbGVyX2lkZW50aXR5LmN1cnJlbnQ6IFJlYWRpbmcuLi5cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZV9yb2xlOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zNjkzNDQ1MDk3XVxubW9kdWxlLmluZnJhaG91c2VfY29tLmF3c19yb3V0ZTUzX3pvbmUuaW5mcmFob3VzZV9jb206IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR11cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5LkFXU0xhbWJkYUJhc2ljRXhlY3V0aW9uUm9sZTogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9Mzg5NDA2ODgyNl1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c192cGMudnBjOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD12cGMtMDhlMTlkODU5YzI2ZDE4YjJdXG5kYXRhLmF3c19hdmFpbGFiaWxpdHlfem9uZXMudXcxOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD11cy13ZXN0LTFdXG5hd3Nfa2V5X3BhaXIuYWxla3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFsZWtzXVxuZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZGluZy4uLlxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2NhbGxlcl9pZGVudGl0eS5jdXJyZW50OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00OTMzNzA4MjY0MjRdXG5tb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuYXdzX2lhbV9yb2xlLnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0MjAyMzA3MTAwNDMwNDQ3NjEwMDAwMDAwMDJdXG5kYXRhLmF3c19hbWkudWJ1bnR1XzIyOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hbWktMDc5MzQ1MmRmODhkMzNjNjNdXG5tb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9yb2xlLmlhbV9mb3JfbGFtYmRhOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pYW1fZm9yX2xhbWJkYV1cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19hbWkudWJ1bnR1XzIyOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD1hbWktMDc5MzQ1MmRmODhkMzNjNjNdXG5tb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuYXdzX2lhbV9wb2xpY3kucHJvZmlsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpwb2xpY3kvanVtcGhvc3QyMDIzMDcxMDA0MzA0NDc2MDQwMDAwMDAwMV1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19laXAubmF0X2VpcFtcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1laXBhbGxvYy0wMmI0MmU3MGQ1MmE1ZGI3Zl1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19laXAubmF0X2VpcFtcIjEwLjAuMi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1laXBhbGxvYy0wMTYwMzUyNDZiNDkxMDJiNV1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzkxMTg0NDg2OF1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uYXdzX2lhbV9yb2xlLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWdpdGh1Yl1cbm1vZHVsZS5qdW1waG9zdC5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sucHVibGljX2FjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1qdW1waG9zdC1sYW1iZGEtMjAyMzA3MTMyMzM0NTk2NzU4MDAwMDAwMDFdXG5tb2R1bGUuanVtcGhvc3QuYXdzX3MzX29iamVjdC5sYW1iZGFfcGFja2FnZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9MmRiZGQzOWUtMzYzMy04NmVkLWMzMjgtNDQ1MDNiZDFhNGRlLnppcF1cbm1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M19yZWNvcmQuc3BmOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfaW5mcmFob3VzZS5jb21fU1BGXVxubW9kdWxlLmluZnJhaG91c2VfY29tLmF3c19yb3V0ZTUzX3JlY29yZC50eHRfZGtpbTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX2dvb2dsZS5fZG9tYWlua2V5LmluZnJhaG91c2UuY29tX1RYVF1cbm1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M19yZWNvcmQubXg6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19pbmZyYWhvdXNlLmNvbV9NWF1cbm1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M19yZWNvcmQudHh0X3NwZjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX2luZnJhaG91c2UuY29tX1RYVF1cbm1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5hd3NfaWFtX2luc3RhbmNlX3Byb2ZpbGUucHJvZmlsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3RdXG5tb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50Lmp1bXBob3N0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdDIwMjMwNzEwMDQzMDQ0NzYxMDAwMDAwMDAyLTIwMjMwNzEwMDQzMDQ1NzgxMTAwMDAwMDAzXVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX2RlZmF1bHRfc2VjdXJpdHlfZ3JvdXAuZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2ctMDhiOTYwYjg1ZjU5OTYxMDBdXG5tb2R1bGUubWFuYWdlbWVudC5hd3NfaW50ZXJuZXRfZ2F0ZXdheS5pZzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWd3LTA3OTA5MGUwOWVkNWRiNTgyXVxubW9kdWxlLmp1bXBob3N0LmF3c19sYW1iZGFfZnVuY3Rpb24udXBkYXRlX2RuczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dXBkYXRlX2Ruc11cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZS5hbGxbXCIxMC4wLjIuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTBiYzZjNDRjMWIyNmZlZDIyXVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX3N1Ym5ldC5hbGxbXCIxMC4wLjAuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c3VibmV0LTBkZjg4NWRjYzk5NDE4Nzk5XVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX3N1Ym5ldC5hbGxbXCIxMC4wLjEuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c3VibmV0LTBmOTFkZDI2NzVlN2ExNmMzXVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX3N1Ym5ldC5hbGxbXCIxMC4wLjIuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c3VibmV0LTA4M2U5NjlkYzM3NzlhZjI2XVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX3N1Ym5ldC5hbGxbXCIxMC4wLjMuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c3VibmV0LTBjZmZmYWNhMzI1ZDkzODI3XVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMDE3OGUxNzE4ZGViYTUxY2VdXG5tb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGUuYWxsW1wiMTAuMC4wLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0Yi0wNGExNmU3NGQ1YjEyYTMzOF1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZS5hbGxbXCIxMC4wLjEuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTA2N2MzMGU2NWRkNDEwOGU5XVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX2RlZmF1bHRfcm91dGVfdGFibGUuZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTBkNzMzODNhZmViNmFkMTQyXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTM4MjkzNzE2OV1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19uYXRfZ2F0ZXdheS5uYXRfZ3dbXCIxMC4wLjIuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9bmF0LTA4YjFjZDA2YjA0MzA5OWVjXVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX25hdF9nYXRld2F5Lm5hdF9nd1tcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1uYXQtMDhmYjliNTI2ODMyNzc5NDddXG5tb2R1bGUuanVtcGhvc3QuYXdzX2Nsb3Vkd2F0Y2hfbG9nX2dyb3VwLnVwZGF0ZV9kbnM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPS9hd3MvbGFtYmRhL3VwZGF0ZV9kbnNdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmF3c19pYW1fcm9sZS5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluXVxubW9kdWxlLmp1bXBob3N0LmF3c19sYXVuY2hfdGVtcGxhdGUuanVtcGhvc3Q6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWx0LTAxYThlZjk2ODIyYjRiMDBiXVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlLmRlZmF1bHRfbWFpbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMGQ3MzM4M2FmZWI2YWQxNDIxMDgwMjg5NDk0XVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlX2Fzc29jaWF0aW9uLnByaXZhdGVfcnRfYXNzb2NbXCIxMC4wLjEuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiYXNzb2MtMDk5Yjk1OGFmMTk0ODVmMmJdXG5tb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuMi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wZTc5NWJkYWVlNjI3YWE2Y11cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC4zLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0YmFzc29jLTBiZjI3OGI2YTM5NGFlZDQ0XVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlX2Fzc29jaWF0aW9uLnByaXZhdGVfcnRfYXNzb2NbXCIxMC4wLjAuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiYXNzb2MtMDhhNDEwMTYwZTJkY2M1OTJdXG5tb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuc3VibmV0X3B1YmxpY1tcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wNGExNmU3NGQ1YjEyYTMzODEwODAyODk0OTRdXG5tb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuc3VibmV0X3B1YmxpY1tcIjEwLjAuMi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wYmM2YzQ0YzFiMjZmZWQyMjEwODAyODk0OTRdXG5tb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuc3VibmV0X3ByaXZhdGVbXCIxMC4wLjEuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMDY3YzMwZTY1ZGQ0MTA4ZTkxMDgwMjg5NDk0XVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlLnN1Ym5ldF9wcml2YXRlW1wiMTAuMC4zLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTAxNzhlMTcxOGRlYmE1MWNlMTA4MDI4OTQ5NF1cbm1vZHVsZS5qdW1waG9zdC5hd3NfYXV0b3NjYWxpbmdfZ3JvdXAuanVtcGhvc3Q6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0LTIwMjMwNzEwMDQ1NTEyMTY1NDAwMDAwMDAxXVxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQubGFtYmRhX2xvZ2dpbmc6IFJlYWRpbmcuLi5cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmxhbWJkYV9sb2dnaW5nOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0yMjY3MTQ1MzgyXVxubW9kdWxlLmp1bXBob3N0LmF3c19pYW1fcG9saWN5LmxhbWJkYV9sb2dnaW5nOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnBvbGljeS9sYW1iZGFfbG9nZ2luZzIwMjMwNzExMTYwNTEzNzc4MzAwMDAwMDAzXVxubW9kdWxlLmp1bXBob3N0LmF3c19jbG91ZHdhdGNoX2V2ZW50X3J1bGUuc2NhbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0LXNjYWxlMjAyMzA3MTExNzI3NDc1MDQ3MDAwMDAwMDFdXG5tb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5sYW1iZGEtcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbm1vZHVsZS5qdW1waG9zdC5hd3NfYXV0b3NjYWxpbmdfbGlmZWN5Y2xlX2hvb2subGF1bmNoaW5nOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1sYXVuY2hpbmddXG5tb2R1bGUuanVtcGhvc3QuYXdzX2F1dG9zY2FsaW5nX2xpZmVjeWNsZV9ob29rLnRlcm1pbmF0aW5nOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJtaW5hdGluZ11cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmxhbWJkYS1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NzQ4MzA1NzMxXVxubW9kdWxlLmp1bXBob3N0LmF3c19pYW1fcG9saWN5LmxhbWJkYV9wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpwb2xpY3kvbGFtYmRhX3Blcm1pc3Npb25zMjAyMzA3MTExNjA1MTI3MjQyMDAwMDAwMDFdXG5tb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmxhbWJkYV9sb2dzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pYW1fZm9yX2xhbWJkYS0yMDIzMDcxMTE2MDUxNDI1MTEwMDAwMDAwNF1cbm1vZHVsZS5qdW1waG9zdC5hd3NfbGFtYmRhX3Blcm1pc3Npb24uYWxsb3dfY2xvdWR3YXRjaDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QWxsb3dFeGVjdXRpb25Gcm9tQ2xvdWRXYXRjaC1vdXRdXG5tb2R1bGUuanVtcGhvc3QuYXdzX2Nsb3Vkd2F0Y2hfZXZlbnRfdGFyZ2V0LnNjYWxlLW91dDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3Qtc2NhbGUyMDIzMDcxMTE3Mjc0NzUwNDcwMDAwMDAwMS10ZXJyYWZvcm0tMjAyMzA3MTExNzI3NDc2MzA5MDAwMDAwMDJdXG5tb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmxhbWJkYV9wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWFtX2Zvcl9sYW1iZGEtMjAyMzA3MTExNjA1MTM0MTYxMDAwMDAwMDJdXG5tb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeS5BV1NMYW1iZGFCYXNpY0V4ZWN1dGlvblJvbGU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMnMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L3NlcnZpY2Utcm9sZS9BV1NMYW1iZGFCYXNpY0V4ZWN1dGlvblJvbGVdXG5tb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LkFXU0xhbWJkYUJhc2ljRXhlY3V0aW9uUm9sZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWFtX2Zvcl9sYW1iZGEtMjAyMzA3MTAxNzU0MzQ4NzgwMDAwMDAwMDFdXG5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDJzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDNzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi0yMDIzMDcwOTE2NDMyMTMxOTkwMDAwMDAwMV1cblxuVGVycmFmb3JtIHVzZWQgdGhlIHNlbGVjdGVkIHByb3ZpZGVycyB0byBnZW5lcmF0ZSB0aGUgZm9sbG93aW5nIGV4ZWN1dGlvblxucGxhbi4gUmVzb3VyY2UgYWN0aW9ucyBhcmUgaW5kaWNhdGVkIHdpdGggdGhlIGZvbGxvd2luZyBzeW1ib2xzOlxuICB+IHVwZGF0ZSBpbi1wbGFjZVxuLS8rIGRlc3Ryb3kgYW5kIHRoZW4gY3JlYXRlIHJlcGxhY2VtZW50XG4gPD0gcmVhZCAoZGF0YSByZXNvdXJjZXMpXG5cblRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOlxuXG4gICMgbW9kdWxlLmp1bXBob3N0LmRhdGEuYXJjaGl2ZV9maWxlLmxhbWJkYSB3aWxsIGJlIHJlYWQgZHVyaW5nIGFwcGx5XG4gICMgKGNvbmZpZyByZWZlcnMgdG8gdmFsdWVzIG5vdCB5ZXQga25vd24pXG4gPD0gZGF0YSBcImFyY2hpdmVfZmlsZVwiIFwibGFtYmRhXCIge1xuICAgICAgKyBleGNsdWRlcyAgICAgICAgICAgID0gW1xuICAgICAgICAgICsgXCJfX3B5Y2FjaGVfX1wiLFxuICAgICAgICBdXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG91dHB1dF9iYXNlNjRzaGEyNTYgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG91dHB1dF9iYXNlNjRzaGE1MTIgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG91dHB1dF9tZDUgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG91dHB1dF9wYXRoICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG91dHB1dF9zaGEgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG91dHB1dF9zaGEyNTYgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG91dHB1dF9zaGE1MTIgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG91dHB1dF9zaXplICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHNvdXJjZV9kaXIgICAgICAgICAgPSBcIm1vZHVsZXMvanVtcGhvc3QvdXBkYXRlX2Ruc1wiXG4gICAgICArIHR5cGUgICAgICAgICAgICAgICAgPSBcInppcFwiXG4gICAgfVxuXG4gICMgbW9kdWxlLmp1bXBob3N0LmF3c19sYW1iZGFfZnVuY3Rpb24udXBkYXRlX2RucyB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2VcbiAgfiByZXNvdXJjZSBcImF3c19sYW1iZGFfZnVuY3Rpb25cIiBcInVwZGF0ZV9kbnNcIiB7XG4gICAgICAgIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwidXBkYXRlX2Ruc1wiXG4gICAgICB+IGxhc3RfbW9kaWZpZWQgICAgICAgICAgICAgICAgICA9IFwiMjAyMy0wNy0xNlQwNToxMzowNC4wMDArMDAwMFwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gczNfa2V5ICAgICAgICAgICAgICAgICAgICAgICAgID0gXCIyZGJkZDM5ZS0zNjMzLTg2ZWQtYzMyOC00NDUwM2JkMWE0ZGUuemlwXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7fVxuICAgICAgICAjICgyMSB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG5cbiAgICAgICAgIyAoMyB1bmNoYW5nZWQgYmxvY2tzIGhpZGRlbilcbiAgICB9XG5cbiAgIyBtb2R1bGUuanVtcGhvc3QuYXdzX3MzX29iamVjdC5sYW1iZGFfcGFja2FnZSBtdXN0IGJlIHJlcGxhY2VkXG4tLysgcmVzb3VyY2UgXCJhd3NfczNfb2JqZWN0XCIgXCJsYW1iZGFfcGFja2FnZVwiIHtcbiAgICAgIH4gYnVja2V0X2tleV9lbmFibGVkICAgICA9IGZhbHNlIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gY29udGVudF90eXBlICAgICAgICAgICA9IFwiYmluYXJ5L29jdGV0LXN0cmVhbVwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gZXRhZyAgICAgICAgICAgICAgICAgICA9IFwiYjU2NWE1NDFhZGIyYjI3NzEyNDRlNzdiOTBiZDE2YmYtM1wiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gaWQgICAgICAgICAgICAgICAgICAgICA9IFwiMmRiZGQzOWUtMzYzMy04NmVkLWMzMjgtNDQ1MDNiZDFhNGRlLnppcFwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4ga2V5ICAgICAgICAgICAgICAgICAgICA9IFwiMmRiZGQzOWUtMzYzMy04NmVkLWMzMjgtNDQ1MDNiZDFhNGRlLnppcFwiICMgZm9yY2VzIHJlcGxhY2VtZW50IC0+IChrbm93biBhZnRlciBhcHBseSkgIyBmb3JjZXMgcmVwbGFjZW1lbnRcbiAgICAgICsga21zX2tleV9pZCAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIC0gbWV0YWRhdGEgICAgICAgICAgICAgICA9IHt9IC0+IG51bGxcbiAgICAgIH4gc2VydmVyX3NpZGVfZW5jcnlwdGlvbiA9IFwiQUVTMjU2XCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBzb3VyY2UgICAgICAgICAgICAgICAgID0gXCJtb2R1bGVzL2p1bXBob3N0LzJkYmRkMzllLTM2MzMtODZlZC1jMzI4LTQ0NTAzYmQxYTRkZS56aXBcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IHN0b3JhZ2VfY2xhc3MgICAgICAgICAgPSBcIlNUQU5EQVJEXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgLSB0YWdzICAgICAgICAgICAgICAgICAgID0ge30gLT4gbnVsbFxuICAgICAgKyB2ZXJzaW9uX2lkICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAjICg0IHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcbiAgICB9XG5cbiAgIyBtb2R1bGUuanVtcGhvc3QubnVsbF9yZXNvdXJjZS5pbnN0YWxsX3B5dGhvbl9kZXBlbmRlbmNpZXMgbXVzdCBiZSByZXBsYWNlZFxuLS8rIHJlc291cmNlIFwibnVsbF9yZXNvdXJjZVwiIFwiaW5zdGFsbF9weXRob25fZGVwZW5kZW5jaWVzXCIge1xuICAgICAgfiBpZCAgICAgICA9IFwiNzI5NDMwNTI4NDk3MjkwMzgyOFwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gdHJpZ2dlcnMgPSB7ICMgZm9yY2VzIHJlcGxhY2VtZW50XG4gICAgICAgICAgfiBcIm1haW5fdmVyc2lvblwiICAgICAgICAgPSBcIjA0ZWM1YWZjNzM0OTUyZTdiNDlkODQ3ZGMyN2Q3NzhhXCIgLT4gXCIwZjNjZjU4Y2Q5YmM5OTg2ZDIzOTk0NTU1N2EzZjIzZFwiXG4gICAgICAgICAgICAjICgxIHVuY2hhbmdlZCBlbGVtZW50IGhpZGRlbilcbiAgICAgICAgfVxuICAgIH1cblxuICAjIG1vZHVsZS5qdW1waG9zdC5yYW5kb21fdXVpZC5sYW1kYV9zcmNfaGFzaCBtdXN0IGJlIHJlcGxhY2VkXG4tLysgcmVzb3VyY2UgXCJyYW5kb21fdXVpZFwiIFwibGFtZGFfc3JjX2hhc2hcIiB7XG4gICAgICB+IGlkICAgICAgPSBcIjJkYmRkMzllLTM2MzMtODZlZC1jMzI4LTQ0NTAzYmQxYTRkZVwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4ga2VlcGVycyA9IHsgIyBmb3JjZXMgcmVwbGFjZW1lbnRcbiAgICAgICAgICB+IFwibWFpbi5weVwiICAgICAgICAgID0gXCIwNGVjNWFmYzczNDk1MmU3YjQ5ZDg0N2RjMjdkNzc4YVwiIC0+IFwiMGYzY2Y1OGNkOWJjOTk4NmQyMzk5NDU1NTdhM2YyM2RcIlxuICAgICAgICAgICAgIyAoMSB1bmNoYW5nZWQgZWxlbWVudCBoaWRkZW4pXG4gICAgICAgIH1cbiAgICAgIH4gcmVzdWx0ICA9IFwiMmRiZGQzOWUtMzYzMy04NmVkLWMzMjgtNDQ1MDNiZDFhNGRlXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuUGxhbjogMyB0byBhZGQsIDEgdG8gY2hhbmdlLCAzIHRvIGRlc3Ryb3kuXG5cblx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFxuXG5TYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhblxuXG5UbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTpcbiAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCJcbjo6ZGVidWc6OlRlcnJhZm9ybSBleGl0ZWQgd2l0aCBjb2RlIDAuXG46OmRlYnVnOjpzdGRvdXQ6IG1vZHVsZS5qdW1waG9zdC5udWxsX3Jlc291cmNlLmluc3RhbGxfcHl0aG9uX2RlcGVuZGVuY2llczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9NzI5NDMwNTI4NDk3MjkwMzgyOF0lMEFtb2R1bGUuanVtcGhvc3QucmFuZG9tX3V1aWQubGFtZGFfc3JjX2hhc2g6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTJkYmRkMzllLTM2MzMtODZlZC1jMzI4LTQ0NTAzYmQxYTRkZV0lMEFkYXRhLmF3c19hdmFpbGFiaWxpdHlfem9uZXMudXcxOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX3JlZ2lvbi5jdXJyZW50OiBSZWFkaW5nLi4uJTBBZGF0YS5hd3NfYW1pLnVidW50dV8yMjogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lmp1bXBob3N0X3Blcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lX3JvbGU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUuZ2l0aHViLWNvbm5lY3Rvci5hd3NfaWFtX29wZW5pZF9jb25uZWN0X3Byb3ZpZGVyLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpvaWRjLXByb3ZpZGVyL3Rva2VuLmFjdGlvbnMuZ2l0aHVidXNlcmNvbnRlbnQuY29tXSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfczNfYnVja2V0LmxhbWJkYV90bXA6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtanVtcGhvc3QtbGFtYmRhLTIwMjMwNzEzMjMzNDU5Njc1ODAwMDAwMDAxXSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19hbWkudWJ1bnR1XzIyOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX3JlZ2lvbi5jdXJyZW50OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD11cy13ZXN0LTFdJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuanVtcGhvc3RfcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTExNTIyNjUxOTJdJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xOTAzODQ5MzMxXSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19jYWxsZXJfaWRlbnRpdHkuY3VycmVudDogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZV9yb2xlOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zNjkzNDQ1MDk3XSUwQW1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M196b25lLmluZnJhaG91c2VfY29tOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0ddJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3kuQVdTTGFtYmRhQmFzaWNFeGVjdXRpb25Sb2xlOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM4OTQwNjg4MjZdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3ZwYy52cGM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXZwYy0wOGUxOWQ4NTljMjZkMThiMl0lMEFkYXRhLmF3c19hdmFpbGFiaWxpdHlfem9uZXMudXcxOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD11cy13ZXN0LTFdJTBBYXdzX2tleV9wYWlyLmFsZWtzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hbGVrc10lMEFkYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2NhbGxlcl9pZGVudGl0eS5jdXJyZW50OiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD00OTMzNzA4MjY0MjRdJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmF3c19pYW1fcm9sZS5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdDIwMjMwNzEwMDQzMDQ0NzYxMDAwMDAwMDAyXSUwQWRhdGEuYXdzX2FtaS51YnVudHVfMjI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFtaS0wNzkzNDUyZGY4OGQzM2M2M10lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9yb2xlLmlhbV9mb3JfbGFtYmRhOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pYW1fZm9yX2xhbWJkYV0lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfYW1pLnVidW50dV8yMjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YW1pLTA3OTM0NTJkZjg4ZDMzYzYzXSUwQW1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5hd3NfaWFtX3BvbGljeS5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnBvbGljeS9qdW1waG9zdDIwMjMwNzEwMDQzMDQ0NzYwNDAwMDAwMDAxXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19laXAubmF0X2VpcFtcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1laXBhbGxvYy0wMmI0MmU3MGQ1MmE1ZGI3Zl0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3NfZWlwLm5hdF9laXBbXCIxMC4wLjIuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ZWlwYWxsb2MtMDE2MDM1MjQ2YjQ5MTAyYjVdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzkxMTg0NDg2OF0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmF3c19pYW1fcm9sZS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1naXRodWJdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWp1bXBob3N0LWxhbWJkYS0yMDIzMDcxMzIzMzQ1OTY3NTgwMDAwMDAwMV0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX3MzX29iamVjdC5sYW1iZGFfcGFja2FnZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9MmRiZGQzOWUtMzYzMy04NmVkLWMzMjgtNDQ1MDNiZDFhNGRlLnppcF0lMEFtb2R1bGUuaW5mcmFob3VzZV9jb20uYXdzX3JvdXRlNTNfcmVjb3JkLnNwZjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX2luZnJhaG91c2UuY29tX1NQRl0lMEFtb2R1bGUuaW5mcmFob3VzZV9jb20uYXdzX3JvdXRlNTNfcmVjb3JkLnR4dF9ka2ltOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfZ29vZ2xlLl9kb21haW5rZXkuaW5mcmFob3VzZS5jb21fVFhUXSUwQW1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M19yZWNvcmQubXg6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19pbmZyYWhvdXNlLmNvbV9NWF0lMEFtb2R1bGUuaW5mcmFob3VzZV9jb20uYXdzX3JvdXRlNTNfcmVjb3JkLnR4dF9zcGY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19pbmZyYWhvdXNlLmNvbV9UWFRdJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmF3c19pYW1faW5zdGFuY2VfcHJvZmlsZS5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdF0lMEFtb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50Lmp1bXBob3N0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdDIwMjMwNzEwMDQzMDQ0NzYxMDAwMDAwMDAyLTIwMjMwNzEwMDQzMDQ1NzgxMTAwMDAwMDAzXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19kZWZhdWx0X3NlY3VyaXR5X2dyb3VwLmRlZmF1bHQ6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXNnLTA4Yjk2MGI4NWY1OTk2MTAwXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19pbnRlcm5ldF9nYXRld2F5LmlnOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pZ3ctMDc5MDkwZTA5ZWQ1ZGI1ODJdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19sYW1iZGFfZnVuY3Rpb24udXBkYXRlX2RuczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dXBkYXRlX2Ruc10lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGUuYWxsW1wiMTAuMC4yLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0Yi0wYmM2YzQ0YzFiMjZmZWQyMl0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdWJuZXQtMGRmODg1ZGNjOTk0MTg3OTldJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3N1Ym5ldC5hbGxbXCIxMC4wLjEuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c3VibmV0LTBmOTFkZDI2NzVlN2ExNmMzXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19zdWJuZXQuYWxsW1wiMTAuMC4yLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN1Ym5ldC0wODNlOTY5ZGMzNzc5YWYyNl0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuMy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdWJuZXQtMGNmZmZhY2EzMjVkOTM4MjddJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMDE3OGUxNzE4ZGViYTUxY2VdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMDRhMTZlNzRkNWIxMmEzMzhdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMDY3YzMwZTY1ZGQ0MTA4ZTldJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX2RlZmF1bHRfcm91dGVfdGFibGUuZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTBkNzMzODNhZmViNmFkMTQyXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hZG1pbi1hc3N1bWU6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMzgyOTM3MTY5XSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19uYXRfZ2F0ZXdheS5uYXRfZ3dbXCIxMC4wLjIuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9bmF0LTA4YjFjZDA2YjA0MzA5OWVjXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19uYXRfZ2F0ZXdheS5uYXRfZ3dbXCIxMC4wLjAuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9bmF0LTA4ZmI5YjUyNjgzMjc3OTQ3XSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfY2xvdWR3YXRjaF9sb2dfZ3JvdXAudXBkYXRlX2RuczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9L2F3cy9sYW1iZGEvdXBkYXRlX2Ruc10lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmF3c19pYW1fcm9sZS5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluXSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfbGF1bmNoX3RlbXBsYXRlLmp1bXBob3N0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1sdC0wMWE4ZWY5NjgyMmI0YjAwYl0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuZGVmYXVsdF9tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wZDczMzgzYWZlYjZhZDE0MjEwODAyODk0OTRdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlX2Fzc29jaWF0aW9uLnByaXZhdGVfcnRfYXNzb2NbXCIxMC4wLjEuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiYXNzb2MtMDk5Yjk1OGFmMTk0ODVmMmJdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlX2Fzc29jaWF0aW9uLnByaXZhdGVfcnRfYXNzb2NbXCIxMC4wLjIuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiYXNzb2MtMGU3OTViZGFlZTYyN2FhNmNdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlX2Fzc29jaWF0aW9uLnByaXZhdGVfcnRfYXNzb2NbXCIxMC4wLjMuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiYXNzb2MtMGJmMjc4YjZhMzk0YWVkNDRdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlX2Fzc29jaWF0aW9uLnByaXZhdGVfcnRfYXNzb2NbXCIxMC4wLjAuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiYXNzb2MtMDhhNDEwMTYwZTJkY2M1OTJdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlLnN1Ym5ldF9wdWJsaWNbXCIxMC4wLjAuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMDRhMTZlNzRkNWIxMmEzMzgxMDgwMjg5NDk0XSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZS5zdWJuZXRfcHVibGljW1wiMTAuMC4yLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTBiYzZjNDRjMWIyNmZlZDIyMTA4MDI4OTQ5NF0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuc3VibmV0X3ByaXZhdGVbXCIxMC4wLjEuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMDY3YzMwZTY1ZGQ0MTA4ZTkxMDgwMjg5NDk0XSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZS5zdWJuZXRfcHJpdmF0ZVtcIjEwLjAuMy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wMTc4ZTE3MThkZWJhNTFjZTEwODAyODk0OTRdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19hdXRvc2NhbGluZ19ncm91cC5qdW1waG9zdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3QtMjAyMzA3MTAwNDU1MTIxNjU0MDAwMDAwMDFdJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQubGFtYmRhX2xvZ2dpbmc6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5sYW1iZGFfbG9nZ2luZzogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MjI2NzE0NTM4Ml0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9wb2xpY3kubGFtYmRhX2xvZ2dpbmc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L2xhbWJkYV9sb2dnaW5nMjAyMzA3MTExNjA1MTM3NzgzMDAwMDAwMDNdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19jbG91ZHdhdGNoX2V2ZW50X3J1bGUuc2NhbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0LXNjYWxlMjAyMzA3MTExNzI3NDc1MDQ3MDAwMDAwMDFdJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQubGFtYmRhLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmp1bXBob3N0LmF3c19hdXRvc2NhbGluZ19saWZlY3ljbGVfaG9vay5sYXVuY2hpbmc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWxhdW5jaGluZ10lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2F1dG9zY2FsaW5nX2xpZmVjeWNsZV9ob29rLnRlcm1pbmF0aW5nOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD10ZXJtaW5hdGluZ10lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5sYW1iZGEtcGVybWlzc2lvbnM6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTc0ODMwNTczMV0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9wb2xpY3kubGFtYmRhX3Blcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnBvbGljeS9sYW1iZGFfcGVybWlzc2lvbnMyMDIzMDcxMTE2MDUxMjcyNDIwMDAwMDAwMV0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmxhbWJkYV9sb2dzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pYW1fZm9yX2xhbWJkYS0yMDIzMDcxMTE2MDUxNDI1MTEwMDAwMDAwNF0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2xhbWJkYV9wZXJtaXNzaW9uLmFsbG93X2Nsb3Vkd2F0Y2g6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUFsbG93RXhlY3V0aW9uRnJvbUNsb3VkV2F0Y2gtb3V0XSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfY2xvdWR3YXRjaF9ldmVudF90YXJnZXQuc2NhbGUtb3V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdC1zY2FsZTIwMjMwNzExMTcyNzQ3NTA0NzAwMDAwMDAxLXRlcnJhZm9ybS0yMDIzMDcxMTE3Mjc0NzYzMDkwMDAwMDAwMl0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmxhbWJkYV9wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWFtX2Zvcl9sYW1iZGEtMjAyMzA3MTExNjA1MTM0MTYxMDAwMDAwMDJdJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3kuQVdTTGFtYmRhQmFzaWNFeGVjdXRpb25Sb2xlOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDJzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9zZXJ2aWNlLXJvbGUvQVdTTGFtYmRhQmFzaWNFeGVjdXRpb25Sb2xlXSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuQVdTTGFtYmRhQmFzaWNFeGVjdXRpb25Sb2xlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pYW1fZm9yX2xhbWJkYS0yMDIzMDcxMDE3NTQzNDg3ODAwMDAwMDAwMV0lMEFkYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDJzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAzcyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5hZG1pbjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLTIwMjMwNzA5MTY0MzIxMzE5OTAwMDAwMDAxXSUwQSUwQVRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb24lMEFwbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6JTBBICB+IHVwZGF0ZSBpbi1wbGFjZSUwQS0vKyBkZXN0cm95IGFuZCB0aGVuIGNyZWF0ZSByZXBsYWNlbWVudCUwQSA8PSByZWFkIChkYXRhIHJlc291cmNlcyklMEElMEFUZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczolMEElMEEgICMgbW9kdWxlLmp1bXBob3N0LmRhdGEuYXJjaGl2ZV9maWxlLmxhbWJkYSB3aWxsIGJlIHJlYWQgZHVyaW5nIGFwcGx5JTBBICAjIChjb25maWcgcmVmZXJzIHRvIHZhbHVlcyBub3QgeWV0IGtub3duKSUwQSA8PSBkYXRhIFwiYXJjaGl2ZV9maWxlXCIgXCJsYW1iZGFcIiB7JTBBICAgICAgKyBleGNsdWRlcyAgICAgICAgICAgID0gWyUwQSAgICAgICAgICArIFwiX19weWNhY2hlX19cIiwlMEEgICAgICAgIF0lMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvdXRwdXRfYmFzZTY0c2hhMjU2ID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgb3V0cHV0X2Jhc2U2NHNoYTUxMiA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG91dHB1dF9tZDUgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvdXRwdXRfcGF0aCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgb3V0cHV0X3NoYSAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG91dHB1dF9zaGEyNTYgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvdXRwdXRfc2hhNTEyICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgb3V0cHV0X3NpemUgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHNvdXJjZV9kaXIgICAgICAgICAgPSBcIm1vZHVsZXMvanVtcGhvc3QvdXBkYXRlX2Ruc1wiJTBBICAgICAgKyB0eXBlICAgICAgICAgICAgICAgID0gXCJ6aXBcIiUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5qdW1waG9zdC5hd3NfbGFtYmRhX2Z1bmN0aW9uLnVwZGF0ZV9kbnMgd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlJTBBICB+IHJlc291cmNlIFwiYXdzX2xhbWJkYV9mdW5jdGlvblwiIFwidXBkYXRlX2Ruc1wiIHslMEEgICAgICAgIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwidXBkYXRlX2Ruc1wiJTBBICAgICAgfiBsYXN0X21vZGlmaWVkICAgICAgICAgICAgICAgICAgPSBcIjIwMjMtMDctMTZUMDU6MTM6MDQuMDAwKzAwMDBcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgfiBzM19rZXkgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIjJkYmRkMzllLTM2MzMtODZlZC1jMzI4LTQ0NTAzYmQxYTRkZS56aXBcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7fSUwQSAgICAgICAgIyAoMjEgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKSUwQSUwQSAgICAgICAgIyAoMyB1bmNoYW5nZWQgYmxvY2tzIGhpZGRlbiklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuanVtcGhvc3QuYXdzX3MzX29iamVjdC5sYW1iZGFfcGFja2FnZSBtdXN0IGJlIHJlcGxhY2VkJTBBLS8rIHJlc291cmNlIFwiYXdzX3MzX29iamVjdFwiIFwibGFtYmRhX3BhY2thZ2VcIiB7JTBBICAgICAgfiBidWNrZXRfa2V5X2VuYWJsZWQgICAgID0gZmFsc2UgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4gY29udGVudF90eXBlICAgICAgICAgICA9IFwiYmluYXJ5L29jdGV0LXN0cmVhbVwiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IGV0YWcgICAgICAgICAgICAgICAgICAgPSBcImI1NjVhNTQxYWRiMmIyNzcxMjQ0ZTc3YjkwYmQxNmJmLTNcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgfiBpZCAgICAgICAgICAgICAgICAgICAgID0gXCIyZGJkZDM5ZS0zNjMzLTg2ZWQtYzMyOC00NDUwM2JkMWE0ZGUuemlwXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4ga2V5ICAgICAgICAgICAgICAgICAgICA9IFwiMmRiZGQzOWUtMzYzMy04NmVkLWMzMjgtNDQ1MDNiZDFhNGRlLnppcFwiICMgZm9yY2VzIHJlcGxhY2VtZW50IC0+IChrbm93biBhZnRlciBhcHBseSkgIyBmb3JjZXMgcmVwbGFjZW1lbnQlMEEgICAgICArIGttc19rZXlfaWQgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgLSBtZXRhZGF0YSAgICAgICAgICAgICAgID0ge30gLT4gbnVsbCUwQSAgICAgIH4gc2VydmVyX3NpZGVfZW5jcnlwdGlvbiA9IFwiQUVTMjU2XCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4gc291cmNlICAgICAgICAgICAgICAgICA9IFwibW9kdWxlcy9qdW1waG9zdC8yZGJkZDM5ZS0zNjMzLTg2ZWQtYzMyOC00NDUwM2JkMWE0ZGUuemlwXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4gc3RvcmFnZV9jbGFzcyAgICAgICAgICA9IFwiU1RBTkRBUkRcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgLSB0YWdzICAgICAgICAgICAgICAgICAgID0ge30gLT4gbnVsbCUwQSAgICAgICsgdmVyc2lvbl9pZCAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgICMgKDQgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5qdW1waG9zdC5udWxsX3Jlc291cmNlLmluc3RhbGxfcHl0aG9uX2RlcGVuZGVuY2llcyBtdXN0IGJlIHJlcGxhY2VkJTBBLS8rIHJlc291cmNlIFwibnVsbF9yZXNvdXJjZVwiIFwiaW5zdGFsbF9weXRob25fZGVwZW5kZW5jaWVzXCIgeyUwQSAgICAgIH4gaWQgICAgICAgPSBcIjcyOTQzMDUyODQ5NzI5MDM4MjhcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgfiB0cmlnZ2VycyA9IHsgIyBmb3JjZXMgcmVwbGFjZW1lbnQlMEEgICAgICAgICAgfiBcIm1haW5fdmVyc2lvblwiICAgICAgICAgPSBcIjA0ZWM1YWZjNzM0OTUyZTdiNDlkODQ3ZGMyN2Q3NzhhXCIgLT4gXCIwZjNjZjU4Y2Q5YmM5OTg2ZDIzOTk0NTU1N2EzZjIzZFwiJTBBICAgICAgICAgICAgIyAoMSB1bmNoYW5nZWQgZWxlbWVudCBoaWRkZW4pJTBBICAgICAgICB9JTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmp1bXBob3N0LnJhbmRvbV91dWlkLmxhbWRhX3NyY19oYXNoIG11c3QgYmUgcmVwbGFjZWQlMEEtLysgcmVzb3VyY2UgXCJyYW5kb21fdXVpZFwiIFwibGFtZGFfc3JjX2hhc2hcIiB7JTBBICAgICAgfiBpZCAgICAgID0gXCIyZGJkZDM5ZS0zNjMzLTg2ZWQtYzMyOC00NDUwM2JkMWE0ZGVcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgfiBrZWVwZXJzID0geyAjIGZvcmNlcyByZXBsYWNlbWVudCUwQSAgICAgICAgICB+IFwibWFpbi5weVwiICAgICAgICAgID0gXCIwNGVjNWFmYzczNDk1MmU3YjQ5ZDg0N2RjMjdkNzc4YVwiIC0+IFwiMGYzY2Y1OGNkOWJjOTk4NmQyMzk5NDU1NTdhM2YyM2RcIiUwQSAgICAgICAgICAgICMgKDEgdW5jaGFuZ2VkIGVsZW1lbnQgaGlkZGVuKSUwQSAgICAgICAgfSUwQSAgICAgIH4gcmVzdWx0ICA9IFwiMmRiZGQzOWUtMzYzMy04NmVkLWMzMjgtNDQ1MDNiZDFhNGRlXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBUGxhbjogMyB0byBhZGQsIDEgdG8gY2hhbmdlLCAzIHRvIGRlc3Ryb3kuJTBBJTBBXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwJTBBJTBBU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW4lMEElMEFUbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTolMEEgICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiJTBBXG46OmRlYnVnOjpzdGRlcnI6IFxuOjpkZWJ1Zzo6ZXhpdGNvZGU6IDBcbiIsICJzdGRlcnIiOiAiIiwgImFkZCI6IDMsICJjaGFuZ2UiOiAxLCAiZGVzdHJveSI6IDN9fQ==```
</p></details>